# AntiparallelRampRisersError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..AntiparallelRampRisersError Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Riser lines are parallel but not collinear. Can't build Run between these Risers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AntiparallelRampRisersError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AntiparallelRampRisersError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AntiparallelRampRisersError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace